SIMPLE_MIXER_FSI/FLUID/system/createPatchDict
/*--------------------------------*- C++ -*----------------------------------*\
  =========                 |
  \\      /  F ield         | OpenFOAM: The Open Source CFD Toolbox
   \\    /   O peration     | Website:  https://openfoam.org
    \\  /    A nd           | Version:  6
     \\/     M anipulation  |
\*---------------------------------------------------------------------------*/
FoamFile
{
    version     2.0;
    format      ascii;
    class       dictionary;
    object      createPatchDict;
}

// * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * //

pointSync false;

// AMI created from internal boundary with cylinder and cylinder_slave patches

/*masterAMI*/
/*{*/
/*    name            AMI1;*/
/*    patchInfo*/
/*    {*/
/*        type            cyclicAMI;*/
/*        matchTolerance  0.0001;*/
/*        neighbourPatch  AMI2;*/
/*        transform       noOrdering;*/
/*    }*/
/*    constructFrom patches;*/
/*    patches (ami);*/
/*}*/

patches
(
		{
        name            new;
    		patchInfo
    		{
        		type            patch;
    		}
    		constructFrom set;
    		set ami0;
    }
    
    
    // master AMI patch
    {
        name            AMI1;
    		patchInfo
    		{
        		type            cyclicAMI;
        		matchTolerance  0.0001;
        		neighbourPatch  AMI2;
        		transform       noOrdering;
    		}
    		constructFrom patches;
    		patches (ami);
    }

    // slave AMI patch
    {
        name            AMI2;
        patchInfo
        {
            type            cyclicAMI;
        		matchTolerance  0.0001;
        		neighbourPatch  AMI1;
        		transform       noOrdering;
        }
        constructFrom patches;
        patches (new);
    }
);


// ************************************************************************* //
