SIMPLE_MIXER_FSI/FLUID/system/fvSchemes
/*--------------------------------*- C++ -*----------------------------------*\
  =========                 |
  \\      /  F ield         | OpenFOAM: The Open Source CFD Toolbox
   \\    /   O peration     | Website:  https://openfoam.org
    \\  /    A nd           | Version:  6
     \\/     M anipulation  |
\*---------------------------------------------------------------------------*/
FoamFile
{
    version     2.0;
    format      ascii;
    class       dictionary;
    location    "system";
    object      fvSchemes;
}
// * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * //

ddtSchemes
{
    default	Euler;
}

d2dt2Schemes
{
}

gradSchemes
{
    default         Gauss linear;
    //grad(U)         leastSquares;
    //grad(U)         cellLimited Gauss linear 1;
    //grad(p)         cellLimited Gauss linear 1;
    //grad(h)         cellLimited Gauss linear 1;
    //grad(k)         cellLimited Gauss linear 1;
    //grad(omega)     cellLimited Gauss linear 1;
}

divSchemes
{
    default         none;
    div(phi,U)      Gauss upwind;
    div(phi,h)      Gauss upwind;
    div(phi,k)      Gauss upwind;
    div(phi,K)      Gauss upwind;
    div(phid,p)     Gauss upwind;
    div(phi,omega)  Gauss upwind;
    div(meshPhi,p)  Gauss upwind;
    div((phi|interpolate(rho)),p) Gauss upwind;
    div(((rho*nuEff)*dev2(T(grad(U))))) Gauss linear;
}

laplacianSchemes
{
    default         Gauss linear limited corrected 0.5;
    //default         Gauss linear corrected;
}

interpolationSchemes
{
    default         linear;
}

snGradSchemes
{
    default         limited corrected 0.5;
    //default					corrected;
}

// ************************************************************************* //
