SIMPLE_MIXER_FSI/FLUID/system/fvSolution
/*--------------------------------*- C++ -*----------------------------------*\
  =========                 |
  \\      /  F ield         | OpenFOAM: The Open Source CFD Toolbox
   \\    /   O peration     | Website:  https://openfoam.org
    \\  /    A nd           | Version:  6
     \\/     M anipulation  |
\*---------------------------------------------------------------------------*/
FoamFile
{
    version     2.0;
    format      ascii;
    class       dictionary;
    location    "system";
    object      fvSolution;
}
// * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * //

solvers
{
    p
    {
        solver          GAMG;
        tolerance       1e-6;
        relTol          0.01;
        smoother        symGaussSeidel;
        nCellsInCoarsestLevel 10;
        minIter         1;
    }
    pFinal
    {
        $p;
        relTol          0;
    }
    pcorr
    {
        $p;
        tolerance       1e-6;
        relTol          0.01;
    }
    pcorrFinal
    {
        $p;
        relTol          0;
    }

  
  
    Phi
    {
        $p;
    }

    "(rho|U|k|omega)"
    {
        solver          smoothSolver;
        smoother        symGaussSeidel;
        tolerance       1e-06;
        relTol          0.01;
        minIter         1;
    }
    
    h
    {
        solver          smoothSolver;
        smoother        symGaussSeidel;
        tolerance       1e-07;
        relTol          0.01;
        minIter         1;
    }

    "(rho|U|h|k|omega)Final"
    {
        $U;
        relTol          0;
    }


    cellDisplacement
    {
        solver          smoothSolver;
        smoother        symGaussSeidel;
        tolerance       1e-20;
        relTol          0.1;
        minIter         10;
        maxIter         100;
    }

    cellDisplacementFinal
    {
        $cellDisplacement
        relTol          0.0;
    }


}

potentialFlow
{
    nNonOrthogonalCorrectors 20;
}

PIMPLE
{
    nOuterCorrectors    2;
    nCorrectors         1;
    nNonOrthogonalCorrectors 2;
    momentumPredictor   yes;
    transonic           no;
    consistent          no;
    simpleRho           no;

    pMax                250000;
    pMin                  7000;

    outerCorrectorResidualControl
    {
        "(U|k|omega|h)"
        {
        	relTol    0.01;
        	tolerance 1e-5;
        }
        p
        {
        	relTol    0.01;
        	tolerance 5e-5;
        }
    }

    turbOnFinalIterOnly no;
}

SIMPLE
{
    transonic           no;
    nNonOrthogonalCorrectors 2;
    consistent          no;
    simpleRho           no;

    pMax                250000;
    pMin                 70000;

    residualControl
    {
        "(U|k|omega|p|h)"  1e-6;
    }

    turbOnFinalIterOnly no;
}


relaxationFactors
{
    fields
    {
        "p.*"           0.8; //0.3;
        "rho.*"         1.0;
    }
    equations
    {
        "U.*"           0.8; //0.7;
        "h.*"           0.8; //0.6;
        "(k|omega).*"   0.8; //0.6;
    }
}


// ************************************************************************* //
